<template>
  <div>
    <a id="title">&#x1F4BB; ABOUT</a>
    <br>
    <a id="contents">안녕하세요.</a>
    <br>
    <a id="contents">3년 차 Frontend 개발자 주완수입니다.</a>
    <br>
    <a id="contents">새로운 Skill을 탐구해보고 잘 사용하진 못하더라도 끄적여보는 것을 좋아합니다.</a>
    <br>
    <a id="contents">혼자 프로젝트를 진행하기 보단 팀 단위로 소통을 하며 새로운 방식의 코드나 기술을 서로 공유하는 방식의 업무를 선호하며, 나만 잘하는 것 보다 함께 성장하는 것이 이상적이라고 생각합니다.</a>
    <br>
    <a id="contents">회사에서 진행하는 프로젝트만을 수행하다가 어느날 문득 '지난 2년 간 나는 코더와 개발자 중 어느쪽인가?' 라는 생각이 들었습니다.</a>
    <br>
    <a id="contents">제가 내린 결론은 전 결국 코더에 지나지 않았고, 스스로 반성하며 그것을 계기로 개발자로 거듭나고자 새로운 마음으로 개발에 진심으로 다가가는 중입니다.</a>
    <br>
    <a id="contents">저의 강점은 새로운 언어를 사용하고 배우는 데에 있어서 두려움이 없습니다. 고등학교시절 VB를 시작으로 C, Delfie나 Java, JS까지 그 순간 필요한 언어를 배우고 사용하며 지금까지 달려왔습니다.</a>
    <br>
    <a id="contents">제가 어디에 있는지에 따라 필요한 언어는 달랐었던 덕분에 저는 현재에 이르기까지 전문적이진 않더라도 여러 언어에 잘 적응하고 사용해왔습니다.</a>
    <br>
    <a id="contents">반면에, 제 성격상 제 자신에 대한 어떠한 결정을 내리는 데에 있어서 우유부단함이 있습니다. 물건을 하나 사더라도 끝까지 어느 선택지가 최선인지 필요 이상으로 고민하는 일이나, 점심 메뉴를 잘 정하지 못하는 등</a>
    <br>
    <a id="contents">오로지 저만을 위한 고민을 하는데에 있어서는 시간을 많이 쓰는 편입니다. 그때문에 제가 친구들이나 동료들과 소통하며 결정하는 것을 좋아하는 것 같습니다.</a>
    <br>
    <a id="contents">아직 저는 너무나도 부족한 개발자입니다. 하지만 제 끄적임들이 모여서 만들어 낼 "일만시간의 법칙"을 믿습니다.</a>
    <br>
    <a id="contents">감사합니다. 좋은 하루 되세요! &#x1F64F;</a>
  </div>
</template>
<style lang="scss">
@import "@/assets/scss/components/AboutMe.scss";
</style>
